{
  "added": "2021-01-04T14:57:07.303Z",
  "info": {
    "contact": {
      "x-twitter": "amentumspace"
    },
    "description": "Our atmosphere protects us from a hostile space radiation environment comprising high energy particles of solar and intergalactic origin. Solar radiation is significant during unpredictable and short lived solar flares and coronal mass ejections (CMEs); however, galactic cosmic radiation (GCR) is omnipresent. The GCR intensity varies with latitude, longitude, and time due to effects of solar activity on the interplanetary magnetic field, as well as the Earth's magnetic field. Space radiation collides with gases in the atmosphere, leading to a complex shower of high energy radiation, the intensity and composition of which varies spatially and temporally. Excessive exposure to radiation can damage DNA and lead to long-term health effects such as an increased risk of cancer.  <br><br> Resulting radiation levels at commercial aircraft altitudes are greater than at sea level. Aircrew are classified as radiation workers in some countries; however, planning to limit their exposure, and monitoring, is generally lacking. Both real-time measurements and predictive models of radiation in the atmosphere are important to mitigate the radiation risk to crew. <br><br>\nWe host a RESTful API to models of cosmic ray induced ionising radiation in the atmosphere. \nThe CARI7 and PARMA endpoints use models developed by the US Federal Aviation Administration and the Japan Atomic Energy Agency to  calculate cosmic radiation doses at a point. \nThe Route Dose API calculates the same quantities along a great circle route between two airports using CARI7. <br><br>\nAPI requests must contain a key \"API-Key\" in the header (see code samples). Obtain a key from  <a href='https://developer.amentum.io'>here</a>. <br><br> \nHelp us improve the quality of our web APIs by completing our 2 minute survey <a href=\"https://www.surveymonkey.com/r/CTDTRBN\">here</a>.<br><br>\nAmentum Pty Ltd is not responsible nor liable for any loss or damage of any sort incurred as a result of using the API. <br><br>\nCopyright <a href='https://amentum.space'>Amentum Pty Ltd</a> 2022.\n",
    "title": "Aviation Radiation API",
    "version": "1.5.0",
    "x-apisguru-categories": [
      "location",
      "open_data"
    ],
    "x-logo": {
      "altText": "Amentum Aerospace",
      "backgroundColor": "#FFFFFF",
      "url": "https://api.apis.guru/v2/cache/logo/https_twitter.com_amentumspace_profile_image"
    },
    "x-origin": [
      {
        "format": "openapi",
        "url": "https://cosmicrays.amentum.space//openapi.json",
        "version": "3.0"
      }
    ],
    "x-providerName": "amentum.space",
    "x-serviceName": "aviation_radiation"
  },
  "updated": "2023-03-06T07:12:59.965Z",
  "swaggerUrl": "https://api.apis.guru/v2/specs/amentum.space/aviation_radiation/1.5.0/openapi.json",
  "swaggerYamlUrl": "https://api.apis.guru/v2/specs/amentum.space/aviation_radiation/1.5.0/openapi.yaml",
  "openapiVer": "3.0.0",
  "link": "https://api.apis.guru/v2/specs/amentum.space:aviation_radiation/1.5.0.json"
}