{
  "apis": {
    "chaingateway.io": {
      "added": "2023-03-30T09:09:47.468Z",
      "info": {
        "contact": {},
        "description": "This API allows you to interact with Ethereum, Binance smart chain, Polygon and Tron blockchain. If you ever looked for a possibility to automate token or payments this is the right place.  \nYou still have no idea for real use cases? Let me give you some examples: Accept your own token as payment method for your shop, distribute airdrop tokens of your ICO, convert your site currency to a token that can be traded on exchanges and many more.  \nThere are a lot of use cases which are not only limited to sending tokens but also receiving them. You could even create a secure wallet for your token which only the wallet owner has access to. Additionally we offer a lot of functions for retrieving blockchain data, including transactions. Using our webhook system, it is possible to receive notifications when events on the blockchain occur, for example when a transfer to a specific address is happening.\n\n# Registering\n\nTo use this Blockchain API, you need to register for a free account on [Chaingateway.io](https://chaingateway.io)\n\nOnce you have created your account, you can create an API key in your Account panel to use with our API.\n\n# Postman\n\nPostman is a great software to test APIs, it helped us a lot when developing this API. If you haven't installed it yet, we recommend to do so\n\nWe have created a Postman collection that allows to import all functions and their settings, including descriptions in Postman. This way you can test all functions with the click of a button (just change the parameters before).\n\n# API Specifications\n\nFor many API clients, websites and development projects you may need a file which specifies all function endpoints of our API. These files can be found in our [Github repository](https://github.com/chaingateway/api-specification), always updated in the formats \"Postman Collection\" and \"OPENAPI/SWAGGER\".\n\n# Authorization\n\nYou can get your personal API Key from your account dashboard. It is used by us to determine who is accessing the API and to count the requests by that account. There are 2 possibilities to use it in your requests:\n\nAdd it in the HTTP header as\n\n`Authorization: q9PdaWuD4j6DK6vsUgehhL8pgarSrS9m`\n\nPlease do not share your api key! If you did so by mistake, immediately regenerate it in your account panel!",
        "title": "Chaingateway.io V2",
        "version": "1.0.0",
        "x-apisguru-categories": [
          "payment"
        ],
        "x-logo": {
          "url": "https://api.apis.guru/v2/cache/logo/https_v1.chaingateway.io_img_Logo_gradient_1000x1000.png"
        },
        "x-origin": [
          {
            "format": "postman",
            "url": "https://raw.githubusercontent.com/chaingateway/api-specification/main/Chaingateway.io.postman_collection.json",
            "version": "2.x"
          }
        ],
        "x-providerName": "chaingateway.io"
      },
      "updated": "2023-03-30T09:09:47.468Z",
      "swaggerUrl": "https://api.apis.guru/v2/specs/chaingateway.io/1.0.0/openapi.json",
      "swaggerYamlUrl": "https://api.apis.guru/v2/specs/chaingateway.io/1.0.0/openapi.yaml",
      "openapiVer": "3.0.3",
      "link": "https://api.apis.guru/v2/specs/chaingateway.io/1.0.0.json"
    }
  }
}