{
  "added": "2018-05-30T12:17:53.000Z",
  "info": {
    "contact": {
      "name": "Bandsintown",
      "url": "https://bandsintown.com/",
      "x-twitter": "Bandsintown"
    },
    "description": "# What is the Bandsintown API?\nThe Bandsintown API is designed for artists and enterprises representing artists.\n\nIt offers read-only access to artist info and artist events:\n- artist info: returns the link to the Bandsintown artist page, the link to the artist photo, the current number of trackers and more\n- artist events: returns the list of events including their date and time, venue name and location, ticket links, lineup, description and the link to the Bandsintown event page\n\nNote you can specify if you only want to return upcoming events, past events, all events, or events within a given date range.\n\n# Getting Started\n- In order to use the Bandsintown API, you must read and accept our Terms and Conditions below and you must have written consent from Bandsintown Inc. Any other use of the Bandsintown API is prohibited. [Contact Bandsintown](http://help.bandsintown.com/) to tell us what you plan to do and request your personal application ID.\n- Find out about the API methods available and the format of the API responses below. Select the method you wish to use and try it out online with the app ID provided to you.\n- Call our Bandsintown API with the app ID provided straight from your website or back-end platform and choose which element of the API response you wish to display. Scroll to the bottom of this page to find out about the Models used.\n",
    "license": {
      "name": "Terms and Conditions",
      "url": "https://corp.bandsintown.com/data-applications-terms"
    },
    "title": "Bandsintown API",
    "version": "3.0.0",
    "x-apisguru-categories": [
      "social"
    ],
    "x-logo": {
      "url": "https://api.apis.guru/v2/cache/logo/https_twitter.com_Bandsintown_profile_image.png"
    },
    "x-origin": [
      {
        "format": "swagger",
        "url": "https://api.swaggerhub.com/apis/Bandsintown/PublicAPI/3.0.0/swagger.yaml",
        "version": "2.0"
      }
    ],
    "x-providerName": "bandsintown.com"
  },
  "updated": "2021-06-21T12:16:53.715Z",
  "swaggerUrl": "https://api.apis.guru/v2/specs/bandsintown.com/3.0.0/swagger.json",
  "swaggerYamlUrl": "https://api.apis.guru/v2/specs/bandsintown.com/3.0.0/swagger.yaml",
  "openapiVer": "2.0",
  "link": "https://api.apis.guru/v2/specs/bandsintown.com/3.0.0.json"
}