basePath: /datastore/v1beta1/datasets
definitions:
  AllocateIdsRequest:
    properties:
      keys:
        description: A list of keys with incomplete key paths to allocate IDs for. No key may be reserved/read-only.
        items:
          $ref: '#/definitions/Key'
        type: array
    type: object
  AllocateIdsResponse:
    properties:
      header:
        $ref: '#/definitions/ResponseHeader'
      keys:
        description: 'The keys specified in the request (in the same order), each with its key path completed with a newly allocated ID.'
        items:
          $ref: '#/definitions/Key'
        type: array
    type: object
  BeginTransactionRequest:
    properties:
      isolationLevel:
        description: 'The transaction isolation level. Either snapshot or serializable. The default isolation level is snapshot isolation, which means that another transaction may not concurrently modify the data that is modified by this transaction. Optionally, a transaction can request to be made serializable which means that another transaction cannot concurrently modify the data that is read or modified by this transaction.'
        type: string
    type: object
  BeginTransactionResponse:
    properties:
      header:
        $ref: '#/definitions/ResponseHeader'
      transaction:
        description: The transaction identifier (always present).
        format: byte
        type: string
    type: object
  BlindWriteRequest:
    properties:
      mutation:
        $ref: '#/definitions/Mutation'
        description: The mutation to perform.
    type: object
  BlindWriteResponse:
    properties:
      header:
        $ref: '#/definitions/ResponseHeader'
      mutationResult:
        $ref: '#/definitions/MutationResult'
        description: The result of performing the mutation (always present).
    type: object
  CommitRequest:
    properties:
      ignoreReadOnly:
        type: boolean
      mutation:
        $ref: '#/definitions/Mutation'
        description: The mutation to perform. Optional.
      transaction:
        description: 'The transaction identifier, returned by a call to beginTransaction. Must be set when mode is TRANSACTIONAL.'
        format: byte
        type: string
    type: object
  CommitResponse:
    properties:
      header:
        $ref: '#/definitions/ResponseHeader'
      mutationResult:
        $ref: '#/definitions/MutationResult'
        description: The result of performing the mutation (if any).
    type: object
  CompositeFilter:
    description: A filter that merges the multiple other filters using the given operation.
    properties:
      filters:
        description: The list of filters to combine. Must contain at least one filter.
        items:
          $ref: '#/definitions/Filter'
        type: array
      operator:
        description: 'The operator for combining multiple filters. Only "and" is currently supported.'
        type: string
    type: object
  Entity:
    description: An entity.
    properties:
      key:
        $ref: '#/definitions/Key'
        description: |-
          The entity's key.

          An entity must have a key, unless otherwise documented (for example, an entity in Value.entityValue may have no key). An entity's kind is its key's path's last element's kind, or null if it has no key.
      properties:
        additionalProperties:
          $ref: '#/definitions/Property'
          description: 'The name of the property. A property name matching regex "__.*__" is reserved. A reserved property name is forbidden in certain documented contexts. The name must not contain more than 500 characters. Cannot be "".'
        description: "The entity's properties."
        type: object
    type: object
  EntityResult:
    description: The result of fetching an entity from the datastore.
    properties:
      entity:
        $ref: '#/definitions/Entity'
        description: The resulting entity.
    type: object
  Filter:
    description: A holder for any type of filter. Exactly one field should be specified.
    properties:
      compositeFilter:
        $ref: '#/definitions/CompositeFilter'
        description: A composite filter.
      propertyFilter:
        $ref: '#/definitions/PropertyFilter'
        description: A filter on a property.
    type: object
  GqlQuery:
    description: A GQL query.
    properties:
      allowLiteral:
        description: 'When false, the query string must not contain a literal.'
        type: boolean
      nameArgs:
        description: 'A named argument must set field GqlQueryArg.name. No two named arguments may have the same name. For each non-reserved named binding site in the query string, there must be a named argument with that name, but not necessarily the inverse.'
        items:
          $ref: '#/definitions/GqlQueryArg'
        type: array
      numberArgs:
        description: 'Numbered binding site @1 references the first numbered argument, effectively using 1-based indexing, rather than the usual 0. A numbered argument must NOT set field GqlQueryArg.name. For each binding site numbered i in query_string, there must be an ith numbered argument. The inverse must also be true.'
        items:
          $ref: '#/definitions/GqlQueryArg'
        type: array
      queryString:
        description: The query string.
        type: string
    type: object
  GqlQueryArg:
    description: A binding argument for a GQL query.
    properties:
      cursor:
        format: byte
        type: string
      name:
        description: 'Must match regex "[A-Za-z_$][A-Za-z_$0-9]*". Must not match regex "__.*__". Must not be "".'
        type: string
      value:
        $ref: '#/definitions/Value'
    type: object
  Key:
    description: A unique identifier for an entity.
    properties:
      partitionId:
        $ref: '#/definitions/PartitionId'
        description: 'Entities are partitioned into subsets, currently identified by a dataset (usually implicitly specified by the project) and namespace ID. Queries are scoped to a single partition.'
      path:
        description: "The entity path. An entity path consists of one or more elements composed of a kind and a string or numerical identifier, which identify entities. The first element identifies a root entity, the second element identifies a child of the root entity, the third element a child of the second entity, and so forth. The entities identified by all prefixes of the path are called the element's ancestors. An entity path is always fully complete: ALL of the entity's ancestors are required to be in the path along with the entity identifier itself. The only exception is that in some documented cases, the identifier in the last path element (for the entity) itself may be omitted. A path can never be empty. The path can have at most 100 elements."
        items:
          $ref: '#/definitions/KeyPathElement'
        type: array
    type: object
  KeyPathElement:
    description: |-
      A (kind, ID/name) pair used to construct a key path.

      At most one of name or ID may be set. If either is set, the element is complete. If neither is set, the element is incomplete.
    properties:
      id:
        description: The ID of the entity. Never equal to zero. Values less than zero are discouraged and will not be supported in the future.
        format: int64
        type: string
      kind:
        description: 'The kind of the entity. A kind matching regex "__.*__" is reserved/read-only. A kind must not contain more than 500 characters. Cannot be "".'
        type: string
      name:
        description: 'The name of the entity. A name matching regex "__.*__" is reserved/read-only. A name must not be more than 500 characters. Cannot be "".'
        type: string
    type: object
  KindExpression:
    description: A representation of a kind.
    properties:
      name:
        description: The name of the kind.
        type: string
    type: object
  LookupRequest:
    properties:
      keys:
        description: Keys of entities to look up from the datastore.
        items:
          $ref: '#/definitions/Key'
        type: array
      readOptions:
        $ref: '#/definitions/ReadOptions'
        description: Options for this lookup request. Optional.
    type: object
  LookupResponse:
    properties:
      deferred:
        description: A list of keys that were not looked up due to resource constraints.
        items:
          $ref: '#/definitions/Key'
        type: array
      found:
        description: Entities found.
        items:
          $ref: '#/definitions/EntityResult'
        type: array
      header:
        $ref: '#/definitions/ResponseHeader'
      missing:
        description: 'Entities not found, with only the key populated.'
        items:
          $ref: '#/definitions/EntityResult'
        type: array
    type: object
  Mutation:
    description: A set of changes to apply.
    properties:
      delete:
        description: Keys of entities to delete. Each key must have a complete key path and must not be reserved/read-only.
        items:
          $ref: '#/definitions/Key'
        type: array
      force:
        description: Ignore a user specified read-only period. Optional.
        type: boolean
      insert:
        description: "Entities to insert. Each inserted entity's key must have a complete path and must not be reserved/read-only."
        items:
          $ref: '#/definitions/Entity'
        type: array
      insertAutoId:
        description: "Insert entities with a newly allocated ID. Each inserted entity's key must omit the final identifier in its path and must not be reserved/read-only."
        items:
          $ref: '#/definitions/Entity'
        type: array
      update:
        description: "Entities to update. Each updated entity's key must have a complete path and must not be reserved/read-only."
        items:
          $ref: '#/definitions/Entity'
        type: array
      upsert:
        description: "Entities to upsert. Each upserted entity's key must have a complete path and must not be reserved/read-only."
        items:
          $ref: '#/definitions/Entity'
        type: array
    type: object
  MutationResult:
    properties:
      indexUpdates:
        description: Number of index writes.
        format: int32
        type: integer
      insertAutoIdKeys:
        description: 'Keys for insertAutoId entities. One per entity from the request, in the same order.'
        items:
          $ref: '#/definitions/Key'
        type: array
    type: object
  PartitionId:
    description: |-
      An identifier for a particular subset of entities.

      Entities are partitioned into various subsets, each used by different datasets and different namespaces within a dataset and so forth.
    properties:
      datasetId:
        description: The dataset ID.
        type: string
      namespace:
        description: The namespace.
        type: string
    type: object
  Property:
    description: An entity property.
    properties:
      multi:
        description: 'If this property contains a list of values. Input values may explicitly set multi to false, but otherwise false is always represented by omitting multi.'
        type: boolean
      values:
        description: 'The value(s) of the property. When multi is false there is always exactly one value. When multi is true there are always one or more values. Each value can have only one value property populated. For example, you cannot have a values list of { values: [ { integerValue: 22, stringValue: "a" } ] }, but you can have { multi: true, values: [ { integerValue: 22 }, { stringValue: "a" } ] }.'
        items:
          $ref: '#/definitions/Value'
        type: array
    type: object
  PropertyExpression:
    description: A representation of a property in a projection.
    properties:
      aggregationFunction:
        description: "The aggregation function to apply to the property. Optional. Can only be used when grouping by at least one property. Must then be set on all properties in the projection that are not being grouped by. Aggregation functions: first selects the first result as determined by the query's order."
        type: string
      property:
        $ref: '#/definitions/PropertyReference'
        description: The property to project.
    type: object
  PropertyFilter:
    description: A filter on a specific property.
    properties:
      operator:
        description: 'The operator to filter by. One of lessThan, lessThanOrEqual, greaterThan, greaterThanOrEqual, equal, or hasAncestor.'
        type: string
      property:
        $ref: '#/definitions/PropertyReference'
        description: The property to filter by.
      value:
        $ref: '#/definitions/Value'
        description: The value to compare the property to.
    type: object
  PropertyOrder:
    description: The desired order for a specific property.
    properties:
      direction:
        description: 'The direction to order by. One of ascending or descending. Optional, defaults to ascending.'
        type: string
      property:
        $ref: '#/definitions/PropertyReference'
        description: The property to order by.
    type: object
  PropertyReference:
    description: A reference to a property relative to the kind expressions.
    properties:
      name:
        description: The name of the property.
        type: string
    type: object
  Query:
    description: A query.
    properties:
      endCursor:
        description: An ending point for the query results. Optional. Query cursors are returned in query result batches.
        format: byte
        type: string
      filter:
        $ref: '#/definitions/Filter'
        description: The filter to apply (optional).
      groupBy:
        description: 'The properties to group by (if empty, no grouping is applied to the result set).'
        items:
          $ref: '#/definitions/PropertyReference'
        type: array
      kinds:
        description: 'The kinds to query (if empty, returns entities from all kinds).'
        items:
          $ref: '#/definitions/KindExpression'
        type: array
      limit:
        description: The maximum number of results to return. Applies after all other constraints. Optional.
        format: int32
        type: integer
      offset:
        description: 'The number of results to skip. Applies before limit, but after all other constraints (optional, defaults to 0).'
        format: int32
        type: integer
      order:
        description: 'The order to apply to the query results (if empty, order is unspecified).'
        items:
          $ref: '#/definitions/PropertyOrder'
        type: array
      projection:
        description: The projection to return. If not set the entire entity is returned.
        items:
          $ref: '#/definitions/PropertyExpression'
        type: array
      startCursor:
        description: A starting point for the query results. Optional. Query cursors are returned in query result batches.
        format: byte
        type: string
    type: object
  QueryResultBatch:
    description: A batch of results produced by a query.
    properties:
      endCursor:
        description: 'A cursor that points to the position after the last result in the batch. May be absent. TODO(arfuller): Once all plans produce cursors update documentation here.'
        format: byte
        type: string
      entityResultType:
        description: 'The result type for every entity in entityResults. full for full entities, projection for entities with only projected properties, keyOnly for entities with only a key.'
        type: string
      entityResults:
        description: The results for this batch.
        items:
          $ref: '#/definitions/EntityResult'
        type: array
      moreResults:
        description: 'The state of the query after the current batch. One of notFinished, moreResultsAfterLimit, noMoreResults.'
        type: string
      skippedResults:
        description: The number of results skipped because of Query.offset.
        format: int32
        type: integer
    type: object
  ReadOptions:
    properties:
      readConsistency:
        description: 'The read consistency to use. One of default, strong, or eventual. Cannot be set when transaction is set. Lookup and ancestor queries default to strong, global queries default to eventual and cannot be set to strong. Optional. Default is default.'
        type: string
      transaction:
        description: The transaction to use. Optional.
        format: byte
        type: string
    type: object
  ResponseHeader:
    properties:
      kind:
        default: 'datastore#responseHeader'
        description: 'Identifies what kind of resource this is. Value: the fixed string "datastore#responseHeader".'
        type: string
    type: object
  RollbackRequest:
    properties:
      transaction:
        description: 'The transaction identifier, returned by a call to beginTransaction.'
        format: byte
        type: string
    type: object
  RollbackResponse:
    properties:
      header:
        $ref: '#/definitions/ResponseHeader'
    type: object
  RunQueryRequest:
    properties:
      gqlQuery:
        $ref: '#/definitions/GqlQuery'
        description: 'The GQL query to run. Either this field or field query must be set, but not both.'
      partitionId:
        $ref: '#/definitions/PartitionId'
        description: 'Entities are partitioned into subsets, identified by a dataset (usually implicitly specified by the project) and namespace ID. Queries are scoped to a single partition. This partition ID is normalized with the standard default context partition ID, but all other partition IDs in RunQueryRequest are normalized with this partition ID as the context partition ID.'
      query:
        $ref: '#/definitions/Query'
        description: 'The query to run. Either this field or field gql_query must be set, but not both.'
      readOptions:
        $ref: '#/definitions/ReadOptions'
        description: The options for this query.
    type: object
  RunQueryResponse:
    properties:
      batch:
        $ref: '#/definitions/QueryResultBatch'
        description: A batch of query results (always present).
      header:
        $ref: '#/definitions/ResponseHeader'
    type: object
  Value:
    description: A message that can hold any of the supported value types and associated metadata.
    properties:
      blobKeyValue:
        description: A blob key value.
        type: string
      blobValue:
        description: 'A blob value. May be a maximum of 1,000,000 bytes. When indexed is true, may have at most 500 bytes.'
        format: byte
        type: string
      booleanValue:
        description: A boolean value.
        type: boolean
      dateTimeValue:
        description: A timestamp value.
        format: date-time
        type: string
      doubleValue:
        description: A double value.
        format: double
        type: number
      entityValue:
        $ref: '#/definitions/Entity'
        description: An entity value. May have no key. May have a key with an incomplete key path. May have a reserved/read-only key.
      indexed:
        description: |-
          If the value should be indexed.

          The indexed property may be set for a null value. When indexed is true, stringValue is limited to 500 characters and the blob value is limited to 500 bytes. Input values by default have indexed set to true; however, you can explicitly set indexed to true if you want. (An output value never has indexed explicitly set to true.) If a value is itself an entity, it cannot have indexed set to true.
        type: boolean
      integerValue:
        description: An integer value.
        format: int64
        type: string
      keyValue:
        $ref: '#/definitions/Key'
        description: A key value.
      meaning:
        description: The meaning field is reserved and should not be used.
        format: int32
        type: integer
      stringValue:
        description: 'A UTF-8 encoded string value. When indexed is true, may have at most 500 characters.'
        type: string
    type: object
externalDocs:
  url: 'https://developers.google.com/datastore/'
host: www.googleapis.com
info:
  contact:
    name: Google
    url: 'https://google.com'
  description: API for accessing Google Cloud Datastore.
  title: Google Cloud Datastore API
  version: v1beta1
  x-apiClientRegistration:
    url: 'https://console.developers.google.com'
  x-logo:
    url: 'https://cloud.google.com/_static/images/new-gcp-logo.png'
  x-origin:
    format: google
    url: 'https://www.googleapis.com/discovery/v1/apis/datastore/v1beta1/rest'
    version: v1
  x-preferred: false
  x-providerName: googleapis.com
  x-serviceName: datastore
parameters:
  alt:
    default: proto
    description: Data format for the response.
    enum:
      - json
      - proto
    in: query
    name: alt
    type: string
  fields:
    description: Selector specifying which fields to include in a partial response.
    in: query
    name: fields
    type: string
  key:
    description: 'API key. Your API key identifies your project and provides you with API access, quota, and reports. Required unless you provide an OAuth 2.0 token.'
    in: query
    name: key
    type: string
  oauth_token:
    description: OAuth 2.0 token for the current user.
    in: query
    name: oauth_token
    type: string
  prettyPrint:
    default: true
    description: Returns response with indentations and line breaks.
    in: query
    name: prettyPrint
    type: boolean
  quotaUser:
    description: 'Available to use for quota purposes for server-side applications. Can be any arbitrary string assigned to a user, but should not exceed 40 characters. Overrides userIp if both are provided.'
    in: query
    name: quotaUser
    type: string
  userIp:
    description: IP address of the site where the request originates. Use this if you want to enforce per-user limits.
    in: query
    name: userIp
    type: string
paths:
  '/{datasetId}/allocateIds':
    parameters:
      - $ref: '#/parameters/alt'
      - $ref: '#/parameters/fields'
      - $ref: '#/parameters/key'
      - $ref: '#/parameters/oauth_token'
      - $ref: '#/parameters/prettyPrint'
      - $ref: '#/parameters/quotaUser'
      - $ref: '#/parameters/userIp'
    post:
      description: Allocate IDs for incomplete keys (useful for referencing an entity before it is inserted).
      operationId: datastore.datasets.allocateIds
      parameters:
        - description: Identifies the dataset.
          in: path
          name: datasetId
          required: true
          type: string
        - in: body
          name: body
          schema:
            $ref: '#/definitions/AllocateIdsRequest'
      responses:
        '200':
          description: Successful response
          schema:
            $ref: '#/definitions/AllocateIdsResponse'
      security:
        - Oauth2:
            - 'https://www.googleapis.com/auth/cloud-platform'
            - 'https://www.googleapis.com/auth/datastore'
            - 'https://www.googleapis.com/auth/userinfo.email'
      tags:
        - datasets
  '/{datasetId}/beginTransaction':
    parameters:
      - $ref: '#/parameters/alt'
      - $ref: '#/parameters/fields'
      - $ref: '#/parameters/key'
      - $ref: '#/parameters/oauth_token'
      - $ref: '#/parameters/prettyPrint'
      - $ref: '#/parameters/quotaUser'
      - $ref: '#/parameters/userIp'
    post:
      description: Begin a new transaction.
      operationId: datastore.datasets.beginTransaction
      parameters:
        - description: Identifies the dataset.
          in: path
          name: datasetId
          required: true
          type: string
        - in: body
          name: body
          schema:
            $ref: '#/definitions/BeginTransactionRequest'
      responses:
        '200':
          description: Successful response
          schema:
            $ref: '#/definitions/BeginTransactionResponse'
      security:
        - Oauth2:
            - 'https://www.googleapis.com/auth/cloud-platform'
            - 'https://www.googleapis.com/auth/datastore'
            - 'https://www.googleapis.com/auth/userinfo.email'
      tags:
        - datasets
  '/{datasetId}/blindWrite':
    parameters:
      - $ref: '#/parameters/alt'
      - $ref: '#/parameters/fields'
      - $ref: '#/parameters/key'
      - $ref: '#/parameters/oauth_token'
      - $ref: '#/parameters/prettyPrint'
      - $ref: '#/parameters/quotaUser'
      - $ref: '#/parameters/userIp'
    post:
      description: 'Create, delete or modify some entities outside a transaction.'
      operationId: datastore.datasets.blindWrite
      parameters:
        - description: Identifies the dataset.
          in: path
          name: datasetId
          required: true
          type: string
        - in: body
          name: body
          schema:
            $ref: '#/definitions/BlindWriteRequest'
      responses:
        '200':
          description: Successful response
          schema:
            $ref: '#/definitions/BlindWriteResponse'
      security:
        - Oauth2:
            - 'https://www.googleapis.com/auth/cloud-platform'
            - 'https://www.googleapis.com/auth/datastore'
            - 'https://www.googleapis.com/auth/userinfo.email'
      tags:
        - datasets
  '/{datasetId}/commit':
    parameters:
      - $ref: '#/parameters/alt'
      - $ref: '#/parameters/fields'
      - $ref: '#/parameters/key'
      - $ref: '#/parameters/oauth_token'
      - $ref: '#/parameters/prettyPrint'
      - $ref: '#/parameters/quotaUser'
      - $ref: '#/parameters/userIp'
    post:
      description: 'Commit a transaction, optionally creating, deleting or modifying some entities.'
      operationId: datastore.datasets.commit
      parameters:
        - description: Identifies the dataset.
          in: path
          name: datasetId
          required: true
          type: string
        - in: body
          name: body
          schema:
            $ref: '#/definitions/CommitRequest'
      responses:
        '200':
          description: Successful response
          schema:
            $ref: '#/definitions/CommitResponse'
      security:
        - Oauth2:
            - 'https://www.googleapis.com/auth/cloud-platform'
            - 'https://www.googleapis.com/auth/datastore'
            - 'https://www.googleapis.com/auth/userinfo.email'
      tags:
        - datasets
  '/{datasetId}/lookup':
    parameters:
      - $ref: '#/parameters/alt'
      - $ref: '#/parameters/fields'
      - $ref: '#/parameters/key'
      - $ref: '#/parameters/oauth_token'
      - $ref: '#/parameters/prettyPrint'
      - $ref: '#/parameters/quotaUser'
      - $ref: '#/parameters/userIp'
    post:
      description: Look up some entities by key.
      operationId: datastore.datasets.lookup
      parameters:
        - description: Identifies the dataset.
          in: path
          name: datasetId
          required: true
          type: string
        - in: body
          name: body
          schema:
            $ref: '#/definitions/LookupRequest'
      responses:
        '200':
          description: Successful response
          schema:
            $ref: '#/definitions/LookupResponse'
      security:
        - Oauth2:
            - 'https://www.googleapis.com/auth/cloud-platform'
            - 'https://www.googleapis.com/auth/datastore'
            - 'https://www.googleapis.com/auth/userinfo.email'
      tags:
        - datasets
  '/{datasetId}/rollback':
    parameters:
      - $ref: '#/parameters/alt'
      - $ref: '#/parameters/fields'
      - $ref: '#/parameters/key'
      - $ref: '#/parameters/oauth_token'
      - $ref: '#/parameters/prettyPrint'
      - $ref: '#/parameters/quotaUser'
      - $ref: '#/parameters/userIp'
    post:
      description: Roll back a transaction.
      operationId: datastore.datasets.rollback
      parameters:
        - description: Identifies the dataset.
          in: path
          name: datasetId
          required: true
          type: string
        - in: body
          name: body
          schema:
            $ref: '#/definitions/RollbackRequest'
      responses:
        '200':
          description: Successful response
          schema:
            $ref: '#/definitions/RollbackResponse'
      security:
        - Oauth2:
            - 'https://www.googleapis.com/auth/cloud-platform'
            - 'https://www.googleapis.com/auth/datastore'
            - 'https://www.googleapis.com/auth/userinfo.email'
      tags:
        - datasets
  '/{datasetId}/runQuery':
    parameters:
      - $ref: '#/parameters/alt'
      - $ref: '#/parameters/fields'
      - $ref: '#/parameters/key'
      - $ref: '#/parameters/oauth_token'
      - $ref: '#/parameters/prettyPrint'
      - $ref: '#/parameters/quotaUser'
      - $ref: '#/parameters/userIp'
    post:
      description: Query for entities.
      operationId: datastore.datasets.runQuery
      parameters:
        - description: Identifies the dataset.
          in: path
          name: datasetId
          required: true
          type: string
        - in: body
          name: body
          schema:
            $ref: '#/definitions/RunQueryRequest'
      responses:
        '200':
          description: Successful response
          schema:
            $ref: '#/definitions/RunQueryResponse'
      security:
        - Oauth2:
            - 'https://www.googleapis.com/auth/cloud-platform'
            - 'https://www.googleapis.com/auth/datastore'
            - 'https://www.googleapis.com/auth/userinfo.email'
      tags:
        - datasets
schemes:
  - https
securityDefinitions:
  Oauth2:
    authorizationUrl: 'https://accounts.google.com/o/oauth2/auth'
    description: Oauth 2.0 authentication
    flow: implicit
    scopes:
      'https://www.googleapis.com/auth/cloud-platform': View and manage your data across Google Cloud Platform services
      'https://www.googleapis.com/auth/datastore': View and manage your Google Cloud Datastore data
      'https://www.googleapis.com/auth/userinfo.email': View your email address
    type: oauth2
swagger: '2.0'
