{
  "added": "2017-07-31T09:48:45.000Z",
  "info": {
    "contact": {
      "name": "eBay Inc,",
      "x-twitter": "ebay"
    },
    "description": "The Browse API has the following resources: item_summary: Lets shoppers search for specific items by keyword, GTIN, category, charity, product, or item aspects and refine the results by using filters, such as aspects, compatibility, and fields values. &nbsp;(Experimental) search_by_image: Lets shoppers search for specific items by image. You can refine the results by using URI parameters and filters. item: Lets you retrieve the details of a specific item or all the items in an item group, which is an item with variations such as color and size and check if a product is compatible with the specified item, such as if a specific car is compatible with a specific part. Provides a bridge between the eBay legacy APIs, such as Finding, and the RESTful APIs, which use different formats for the item IDs. &nbsp;(Experimental) shopping_cart: Provides the ability for eBay members to see the contents of their eBay cart, and add, remove, and change the quantity of items in their eBay cart.&nbsp;&nbsp; Note: This resource is not available in the eBay API Explorer. The item_summary, search_by_image, and item resource calls require an Application access token. The shopping_cart resource calls require a User access token.",
    "license": {
      "name": "eBay API License Agreement",
      "url": "https://go.developer.ebay.com/api-license-agreement"
    },
    "title": "Browse API",
    "version": "v1.1.0",
    "x-apisguru-categories": [
      "ecommerce"
    ],
    "x-logo": {
      "backgroundColor": "#FFFFFF",
      "url": "https://api.apis.guru/v2/cache/logo/https_twitter.com_ebay_profile_image.jpeg"
    },
    "x-origin": [
      {
        "format": "swagger",
        "url": "https://developer.ebay.com/api-docs/master/buy/browse/openapi/2/buy_browse_v1_beta_oas2.json",
        "version": "2.0"
      }
    ],
    "x-providerName": "ebay.com",
    "x-serviceName": "buy-browse"
  },
  "updated": "2020-11-02T10:00:44.960Z",
  "swaggerUrl": "https://api.apis.guru/v2/specs/ebay.com/buy-browse/v1.1.0/swagger.json",
  "swaggerYamlUrl": "https://api.apis.guru/v2/specs/ebay.com/buy-browse/v1.1.0/swagger.yaml",
  "openapiVer": "2.0",
  "link": "https://api.apis.guru/v2/specs/ebay.com:buy-browse/v1.1.0.json"
}