{
  "added": "2020-07-10T08:57:08.681Z",
  "info": {
    "contact": {
      "x-twitter": "Rapid_API"
    },
    "description": "Hyperlocal Demographics, Vehicle Traffic, Economic, Market Signals, and More. Use this API to request IdealSpot hyperlocal geospatial market insight and geometry data. \n\n## Detailed Description\n\nUse this API as your **local economy microscope** by querying [IdealSpot](https://www.idealspot.com) hyperlocal market insight and geometry data. We offer the most precise, extensive, and frequently-updated local market data in the US. Our data is available across the entire US and can be queried at geographic scales ranging from the micro (Census block) through the macro (nation).\n\nBetter data and analysis leads to a better understanding of local market opportunities and risks. Integrate with your commercial real estate and marketing applications, machine learning workflows, and other investment analytics.\n\nOur goal is to offer the most complete snapshot of the geographically distributed consumer and retail economy. We start with the fundamentals of consumers and business establishments. To connect retailers with consumers, we provide mobility data like vehicle traffic and mobile device data. To describe consumer intent, we provide geolocated digital marketing data. \n\nWe believe that accurate capital allocation through reliable local market data is foundational to creating robust, healthy, and livable communities for all. We hope you and your clients find tremendous value in this service.\n\n## Features\n\nQuery data and GeoJSON geometries at these scales for any US latitude and longitude:\n\n* Rings (0.5 km+)\n* Drive time (1-60 minutes)\n* Bike time (3-60 minutes)\n* Walk time (5-60 minutes)\n* Public transit time (5-60 minutes)\n* Administrative region (US, states, core-based statistical areas, counties, Census-designated places, Census tracts, zipcodes, Census block groups, opportunity zones)\n\n| Data Feature | Description |\n| ------- | ------------------------------|\n| Demographics, Housing, Spending | *Updated Quarterly*.  Current and historical market data including population, spending, and housing. Vendor (PopStats) is relied upon by Walgreens, Ulta Beauty, Blackstone, etc |\n| Labor, Business Establishments, Economic Conditions | *Updated Quarterly*.  Traditional market data including workforce, business establishment counts, and economic conditions like local GDP, unemployment rates. Vendor (PopStats) is relied upon by Walgreens, Ulta Beauty, Blackstone, etc |\n| Consumer segmentation\t| *Updated Annually*. Demographics grouped into narrative-oriented segments. |\n| Vehicle Traffic |\t*Updated semi-annually*. Gold standard in vehicle traffic data from INRIX. Counts by day of week, time of day and side of street. |\n| Rings and Travel time polygons | *Estimate in Real-time*. Rings alongside drive time, walk time, bike time, and public transit time polygons. Request as GeoJSON geometries for mapping or use with data queries |\n| Administrative region polygons | *Updated Annually*. GeoJSON administrative regions from US Census Bureau: block groups, tracts, counties, CBSAs, states, opportunity zones, USPS zipcodes |\n| Internet Search Volumes | 30 day rolling averages for geolocated advertising potential across 450 business categories from major search engines |\n| Social Media Interest\t| 30 day rolling average for geolocated advertising potential across 450 business categories from major social networks |\n\n### Coming Soon!\n\nThis API powers our local market research platform at [IdealSpot.com](https://www.idealspot.com). The functionality exposed so far is only a portion of our current capabilities. We will be exposing additional API features in time so watch this space!\n\n| Data Feature | Description |\n| ------- | ------------------------------|\nMobile device visit counts, points of interest, brands | Fresh point of interest data across 3000+ brands, millions of POI, and historical foot traffic counts using mobile data for those points of interest\nOrigin/destination trips from mobile devices | Map origins and destinations of devices visiting an arbitrary catchment area\nCompetition search | Search all major point-of-interest aggregators in one query\nEnvironment/climate | Expected weather patterns like temperature and precipitation\nFilter search API | Query data for all counties in state, all tracts in MSA, etc\nRoad segment tiles | Plot road segments on maps in interactive applications\n\n## Developer Website\n\nFor more detail see https://developer.idealspot.com/",
    "title": "IdealSpot GeoData",
    "version": "1.0",
    "x-apisguru-categories": [
      "text"
    ],
    "x-logo": {
      "url": "https://api.apis.guru/v2/cache/logo/https_twitter.com_Rapid_API_profile_image.jpeg"
    },
    "x-origin": [
      {
        "format": "openapi",
        "url": "https://idealspot.gitlab.io/developer-docs/specs/idealspot-swagger20.json",
        "version": "3.0"
      }
    ],
    "x-providerName": "rapidapi.com",
    "x-serviceName": "idealspot-geodata"
  },
  "updated": "2021-06-21T12:16:53.715Z",
  "swaggerUrl": "https://api.apis.guru/v2/specs/rapidapi.com/idealspot-geodata/1.0/openapi.json",
  "swaggerYamlUrl": "https://api.apis.guru/v2/specs/rapidapi.com/idealspot-geodata/1.0/openapi.yaml",
  "openapiVer": "3.0.0",
  "link": "https://api.apis.guru/v2/specs/rapidapi.com:idealspot-geodata/1.0.json"
}