{
  "added": "2020-08-25T09:06:08.440Z",
  "info": {
    "contact": {
      "email": "info@obp.ch",
      "name": "Open Banking Project Switzerland",
      "url": "https://www.openbankingproject.ch"
    },
    "description": "# Summary\nThe **Swiss NextGen API** is based on the NextGenPSD2 *Framework Version 1.3.4* of the Berlin Group which offers a modern, open, harmonised and interoperable set of\nApplication Programming Interfaces (APIs) as the safest and most efficient way to provide data securely.\nThe NextGen Framework reduces XS2A complexity and costs, addresses the problem of multiple competing standards\nin Europe and, aligned with the goals of the Euro Retail Payments Board,\nenables European banking customers to benefit from innovative products and services ('Banking as a Service')\nby granting TPPs safe and secure (authenticated and authorised) access to their bank accounts and financial data.\n\nThe Swiss edtion refines the message formats specific to Switzerland and defines some matching examples.\n\nThe possible Approaches are:\n  * Redirect SCA Approach\n  * *(Not recommended by obp.ch community) OAuth SCA Approach*\n  * *(Not recommended by obp.ch community) Decoupled SCA Approach*\n  * *(Not recommended by obp.ch community) Embedded SCA Approach without SCA method*\n  * *(Not recommended by obp.ch community) Embedded SCA Approach with only one SCA method available*\n  * *(Not recommended by obp.ch community) Embedded SCA Approach with Selection of a SCA method*\n\n  Not every message defined in this API definition is necessary for all approaches.\n  Furthermore this API definition does not differ between methods which are mandatory, conditional, or optional\n  Therefore for a particular implementation of a compliant API it is only necessary to support\n  a certain subset of the methods defined in this API definition.\n\n  **Please have a look at the implementation guidelines if you are not sure\n  which message has to be used for the approach you are going to use.**\n\n## Some General Remarks Related to this version of the OpenAPI Specification:\n* **This API definition is based on the Implementation Guidelines of the [Berlin Group API](https://www.berlin-group.org/nextgenpsd2-downloads).**\n  It is not a replacement in any sense.\n  The main specification is (at the moment) always the Implementation Guidelines of the Berlin Group API.\n* **This API definition contains the REST-API for requests from the PISP to the ASPSP.**\n* **This API definition contains the messages for all different approaches defined in the Implementation Guidelines.**\n* According to the OpenAPI-Specification [https://github.com/OAI/OpenAPI-Specification/blob/master/versions/3.0.1.md]\n\n    \"If in is \"header\" and the name field is \"Accept\", \"Content-Type\" or \"Authorization\", the parameter definition SHALL be ignored.\"\n\n  The element \"Accept\" will not be defined in this file at any place.\n\n  The elements \"Content-Type\" and \"Authorization\" are implicitly defined by the OpenApi tags \"content\" and \"security\".\n\n* There are several predefined types which might occur in payment initiation messages,\n  but are not used in the standard JSON messages in the Implementation Guidelines.\n  Therefore they are not used in the corresponding messages in this file either.\n  We added them for the convenience of the user.\n  If there is a payment product, which needs these fields, one can easily use the predefined types.\n  But the ASPSP need not to accept them in general.\n\n* **We omit the definition of all standard HTTP header elements (mandatory/optional/conditional)\n  except they are mentioned in the Implementation Guidelines.**\n  Therefore the implementer might add these in his own realisation of a comlient API in addition to the elements defined in this file.\n\n## General Remarks on Data Types\n\nThe Berlin Group definition of UTF-8 strings in context of the API have to support at least the following characters\n\na b c d e f g h i j k l m n o p q r s t u v w x y z\n\nA B C D E F G H I J K L M N O P Q R S T U V W X Y Z\n\n0 1 2 3 4 5 6 7 8 9\n\n/ - ? : ( ) . , ' +\n\nSpace\n",
    "license": {
      "name": "Creative Commons Attribution 4.0 International Public License",
      "url": "https://creativecommons.org/licenses/by/4.0/"
    },
    "title": "Swiss NextGen Banking API-Framework",
    "version": "1.3.8_2020-12-14 - Swiss edition 1.3.8.1-CH",
    "x-apisguru-categories": [
      "financial"
    ],
    "x-logo": {
      "altText": "Swiss OpenBankingProject Logo",
      "backgroundColor": "#FFFFFF",
      "url": "https://api.apis.guru/v2/cache/logo/https_openbankingproject-ch.github.io_obp-apis_swiss-ng-logo.png"
    },
    "x-origin": [
      {
        "format": "openapi",
        "url": "https://raw.githubusercontent.com/openbankingproject-ch/obp-apis/master/swiss-ng-api.yaml",
        "version": "3.0"
      }
    ],
    "x-providerName": "openbankingproject.ch"
  },
  "externalDocs": {
    "description": "Full Documentation of NextGen Access to Account Interoperability Framework\n(General Introduction Paper, Operational Rules, Implementation Guidelines)\n",
    "url": "https://github.com/openbankingproject-ch/obp-apis"
  },
  "updated": "2021-07-19T09:27:57.385Z",
  "swaggerUrl": "https://api.apis.guru/v2/specs/openbankingproject.ch/1.3.8_2020-12-14 - Swiss edition 1.3.8.1-CH/openapi.json",
  "swaggerYamlUrl": "https://api.apis.guru/v2/specs/openbankingproject.ch/1.3.8_2020-12-14 - Swiss edition 1.3.8.1-CH/openapi.yaml",
  "openapiVer": "3.0.1",
  "link": "https://api.apis.guru/v2/specs/openbankingproject.ch/1.3.8_2020-12-14 - Swiss edition 1.3.8.1-CH.json"
}