{
  "added": "2020-03-23T14:14:07.000Z",
  "info": {
    "description": "## Introduction\n\n\nThe Shorten.rest API allows you to programmatically create short URLs (an &apos;alias&apos;) for longer URL (a &apos;destination&apos;).\n\nEach alias you create can be used to redirect the end user (person clicking on the link) to one or more destination URLs\n\nA default destination is always set and specific destinations can be set to redirect the end user to preferred destinations based on the user&apos;s geographical location (country) and device Operating System.\n\nIn order to use the Shorten.Rest URL Shortening API you can choose to bind your own branded domain, sub-domain or to use our default domain - Short.FYI \n\n ### Destination Matching \n\n When creating or editing a short URL (&apos;alias&apos;) you can choose to specify a destination for each country and OS ([Supported OSes list](#tag/OperatingSystems)) combination. \n\n When a user clicks on the short link, Shorten.rest will examine the end user's country (determined by User's IP) and OS (User agent) and match the most suitable destination for each user. \n\n (*) If no destination is set for a specific request combination Shorten.rest will use the default destination that exists within each short URL \n\n (**) BRANDED DOMAINS: If the requested alias does not exist in our database - Shorten.rest will redirect the user to the default fallback you set within your dashboard under the ‘Alias Not Found Page Url’ value for a custom domain. \n\n (***) Operating System (OS) destinations are stronger than a country destination! \n For example - if you have a custom landing page that is targeting people in the USA and a second landing page that is hyper focused for people who use iOS devices - a person clicking on your link in the USA that is on an iPhone will be redirected to the iOS landing page, while all other devices will be redirected to the USA landing page. \n\n | OS  | Country  | Destination |\n| :------------: |:---------------:| -----|\n| iOS      |  | YourDestination.com/ios |\n|       | US        |   YourDestination.com/usa | \n\n Shorten.rest will choose the YourDestination.com/ios url as the most suitable destination.\n\n ### Branded Domain Attributes \n\n When setting up your custom domain you can include optional metatags and snippets ([Supported snippets list](#tag/Snippets)). These parameters (such as retargeting, tracking and conversion pixels) are populated and fired on click - at the time of the redirect. \n\n By default the parameters you set in the domain setting will be included in all Short URLs associated with that domain. \n\n You can always override the domain defaults for each URL by passing the appropriate variables when creating or updating a short URL \n\n ### Setting a Custom string for an Alias (short.fyi/alias) \n\n While creating a short URL you can specify which domain to use. You can choose to use your own branded domain or our default domain - Short.fyi. \n\n Each Alias is unique within a domain they are related to. This means that if multiple accounts use you the same domain (for example short.fyi), if an alias is already taken you may not create a new destination for it.\n\n That said - If you would like to use a specific alias which is already taken - the only way to do so is to create it on a new domain you own and have attached to your Shorten.rest account. \n\n ### Random Aliases \n\n By default - unless you specify a vanity URI for your alias each URL that is shortened on our platform will have a random string generated by the API. This means that if the &apos;alias&apos; attribute of a /aliases POST request is not provided, or is an empty string, a random string of seven characters will be generated and returned as part of the POST response. \n\n You can also place the @**rnd** macro within the alias field when you create a new alias, for example /vanity/@rnd, which might return an alias like /vanity/ZMAefRt, or /vanity@rnd, which might produce something like /vanityMRtvxadf. Only the first @rnd in an alias attribute will be replaced. \n\n ### NOTES \n\n ( * ) All methods of the Shorten.REST API require that your API key be provided in **x-api-key** header. \n\n (**) All API parameters are case sensitive",
    "title": "Shorten.REST API Documentation",
    "version": "1.0.0",
    "x-apisguru-categories": [
      "developer_tools"
    ],
    "x-logo": {
      "backgroundColor": "rgb(236, 236, 236)",
      "href": "https://shorten.rest",
      "url": "https://api.apis.guru/v2/cache/logo/https_docs.shorten.rest_assets_logo.png"
    },
    "x-origin": [
      {
        "format": "openapi",
        "url": "https://docs.shorten.rest/swagger.json",
        "version": "3.0"
      }
    ],
    "x-providerName": "shorten.rest"
  },
  "externalDocs": {
    "description": "Visit main site",
    "url": "https://shorten.rest"
  },
  "updated": "2023-03-06T07:12:59.965Z",
  "swaggerUrl": "https://api.apis.guru/v2/specs/shorten.rest/1.0.0/openapi.json",
  "swaggerYamlUrl": "https://api.apis.guru/v2/specs/shorten.rest/1.0.0/openapi.yaml",
  "openapiVer": "3.0.0",
  "link": "https://api.apis.guru/v2/specs/shorten.rest/1.0.0.json"
}